Documents/data-structures/matrix.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-11 Mon 13:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Matrix</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yao Xiao" />
<link rel="stylesheet" type="text/css" href="../../static/css/reset.css" />
<link rel="stylesheet" type="text/css" href="../../static/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Matrix</h1>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffb86c;">#if</span><span style="color: #ffb86c;">n</span><span style="color: #ffb86c;">def</span> __MATRIX_H_INCLUDED__
<span style="color: #ffb86c;">#define</span> <span style="color: #f8f8f2;">__MATRIX_H_INCLUDED__</span>
<span style="color: #ffb86c;">#include</span> <span style="color: #f8f8f2;">&lt;</span><span style="color: #f1fa8c;">stdlib.h</span><span style="color: #f8f8f2;">&gt;</span>
<span style="color: #ffb86c;">#include</span> <span style="color: #f8f8f2;">&lt;</span><span style="color: #f1fa8c;">string.h</span><span style="color: #f8f8f2;">&gt;</span>
<span style="color: #ffb86c;">#define</span> <span style="color: #f8f8f2;">T</span> <span style="color: #bd93f9;">int</span>

<span style="color: #ff79c6; font-weight: bold;">struct</span> <span style="color: #bd93f9;">matrix_t</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">row_count</span>;
  <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">col_count</span>;
  <span style="color: #bd93f9;">T</span> * <span style="color: #f8f8f2;">data</span>;
<span style="color: #f8f8f2;">}</span>;
<span style="color: #ff79c6; font-weight: bold;">typedef</span> <span style="color: #ff79c6; font-weight: bold;">struct</span> <span style="color: #bd93f9;">matrix_t</span> * <span style="color: #bd93f9;">matrix_t</span>;

<span style="color: #bd93f9;">matrix_t</span> <span style="color: #50fa7b; font-weight: bold;">matrix_make</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">row_count</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">col_count</span><span style="color: #f8f8f2;">)</span>;
<span style="color: #bd93f9;">void</span>  <span style="color: #50fa7b; font-weight: bold;">matrix_free</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">matrix_t</span> * <span style="color: #f8f8f2;">ptr</span><span style="color: #f8f8f2;">)</span>;
<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">matrix_clear0</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">matrix_t</span> <span style="color: #f8f8f2;">matrix</span><span style="color: #f8f8f2;">)</span>;
<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">matrix_clear1</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">matrix_t</span> <span style="color: #f8f8f2;">matrix</span><span style="color: #f8f8f2;">)</span>;
<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">matrix_set</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">matrix_t</span> <span style="color: #f8f8f2;">matrix</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">row</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">col</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">value</span><span style="color: #f8f8f2;">)</span>;
<span style="color: #bd93f9;">T</span> <span style="color: #50fa7b; font-weight: bold;">matrix_get</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">matrix_t</span> <span style="color: #f8f8f2;">matrix</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">row</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">col</span><span style="color: #f8f8f2;">)</span>;

<span style="color: #bd93f9;">matrix_t</span> <span style="color: #50fa7b; font-weight: bold;">matrix_make</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">row_count</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">col_count</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #ff79c6; font-weight: bold;">struct</span> <span style="color: #bd93f9;">matrix_t</span> * <span style="color: #f8f8f2;">ptr</span> = malloc<span style="color: #8be9fd;">(</span><span style="color: #ff79c6; font-weight: bold;">sizeof</span><span style="color: #bd93f9;">(</span>*ptr<span style="color: #bd93f9;">)</span> + <span style="color: #ff79c6; font-weight: bold;">sizeof</span><span style="color: #bd93f9;">(</span>T<span style="color: #bd93f9;">)</span> * row_count * col_count<span style="color: #8be9fd;">)</span>;
  ptr-&gt;row_count = row_count;
  ptr-&gt;col_count = col_count;
  ptr-&gt;data = <span style="color: #8be9fd;">(</span><span style="color: #bd93f9;">T</span> *<span style="color: #8be9fd;">)</span> <span style="color: #8be9fd;">(</span>ptr + <span style="color: #8be9fd;">1</span><span style="color: #8be9fd;">)</span>;
  <span style="color: #ff79c6; font-weight: bold;">return</span> ptr;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">matrix_free</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">matrix_t</span> * <span style="color: #f8f8f2;">ptr</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  free<span style="color: #8be9fd;">(</span>*ptr<span style="color: #8be9fd;">)</span>;
  *ptr = <span style="color: #8be9fd;">NULL</span>;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">matrix_clear0</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">matrix_t</span> <span style="color: #f8f8f2;">matrix</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  memset<span style="color: #8be9fd;">(</span>matrix-&gt;data, <span style="color: #8be9fd;">0</span>, <span style="color: #ff79c6; font-weight: bold;">sizeof</span><span style="color: #bd93f9;">(</span>T<span style="color: #bd93f9;">)</span> * matrix-&gt;row_count * matrix-&gt;col_count<span style="color: #8be9fd;">)</span>;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">matrxi_clear1</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">matrix_t</span> <span style="color: #f8f8f2;">matrix</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  memset<span style="color: #8be9fd;">(</span>matrix-&gt;data, -<span style="color: #8be9fd;">1</span>, <span style="color: #ff79c6; font-weight: bold;">sizeof</span><span style="color: #bd93f9;">(</span>T<span style="color: #bd93f9;">)</span> * matrix-&gt;row_count * matrix-&gt;col_count<span style="color: #8be9fd;">)</span>;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">matrix_set</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">matrix_t</span> <span style="color: #f8f8f2;">matrix</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">row</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">col</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">value</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  matrix-&gt;data<span style="color: #8be9fd;">[</span>row * matrix-&gt;col_count + col<span style="color: #8be9fd;">]</span> = value;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">T</span> <span style="color: #50fa7b; font-weight: bold;">matrix_get</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">matrix_t</span> <span style="color: #f8f8f2;">matrix</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">row</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">col</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #ff79c6; font-weight: bold;">return</span> matrix-&gt;data<span style="color: #8be9fd;">[</span>row * matrix-&gt;col_count + col<span style="color: #8be9fd;">]</span>;
<span style="color: #f8f8f2;">}</span>
<span style="color: #ffb86c;">#undef</span> T
<span style="color: #ffb86c;">#endif</span> <span style="color: #6272a4;">// </span><span style="color: #6272a4;">__MATRIX_H_INCLUDED__</span>
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yao Xiao</p>
<p class="date">Created: 2019-03-11 Mon 13:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
